---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.StructuralWallUsage
source: html/5a521e68-0dd5-b622-4845-6f0b32d7536e.htm
---
# Autodesk.Revit.DB.Structure.StructuralWallUsageFilter.StructuralWallUsage Property

The wall structural usage.

## Syntax (C#)
```csharp
public StructuralWallUsage StructuralWallUsage { get; }
```